jan-liefting/TM4C123/Lab5_FunctionsInC_API/main.c
// ***** 0. Documentation Section *****
// main.c
//     Runs on TM4C123
//     UART runs at 115,200 baud rate
//     Daniel Valvano
//     June 17, 2013
// Lab 5
//      Jon Valvano and Ramesh Yerraballi
//      January 15, 2016

// ***** 1. Pre-processor Directives Section *****
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

// ***** 2. Global Declarations Section *****

// FUNCTION PROTOTYPES: Each subroutine defined
unsigned long Calc_Area(unsigned long l, unsigned long w);

// ***** 3. Subroutines Section *****
int main(void)
{
    unsigned long length, width, area;

    // Initialize first the PLL and then the UART PA0-1

    UARTprintf("\nThis program calculates areas of rectangular rooms.\n");
    while (1)
    {
        UARTprintf("\nGive length: ");
        UARTscanf("%i", &length);  // Get input
        UARTprintf("\nGive width: ");
        UARTscanf("%i", &width);   // Get input
        UARTarea = Calc_Area(length, width);
        UARTprintf("\nArea of the room = %i\n", area);
    }
}

// Computes the Area of a rectangular room whose sides are given
// Input:  the length (l) and width (w) are the dimensions of a rectangle
// Output: the area of the rectangular room
// Notes:  Return a result of zero if
//    the length is less than 3,
//    the width is less than 3,
//    the length is greater than 20 or
//    the width is greater than 20.
unsigned long Calc_Area(unsigned long l, unsigned long w)
{
//  unsigned long result;

// Put your Lab 5 code here
    if (l < 3 | l > 20 | w < 3 | w > 20)
    {
        return (0);
    }

    return (l * w);
}
